In [1]:
from MySQLdb import connect
import pandas as pd

/var/folders/fb/xl0hnskx527bfqkv38l3sn7h0000gn/T/ipykernel_19421/3687392072.py:2: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [2]:
# Connect to your MySQLdb
#conn = connect(host='localhost', user='root')
conn = connect(host='127.0.0.1', user='root', password = 'root', port = 8890)

In [3]:
# Open a cursor to perform database operations
cur = conn.cursor()

In [4]:
# Return data from the Customers table:
cur.execute('''SHOW DATABASES;''')
df = pd.DataFrame(tuple(t) for t in cur.fetchall())
df.columns = [i[0] for i in cur.description]
df

             Database
0  information_schema
1               mysql
2  performance_schema
3              sqlw3s
4                 sys
5              testDB

The SQL CREATE TABLE Statement
- The CREATE TABLE statement is used to create a new table in a database.
- The column parameters specify the names of the columns of the table.
- The datatype parameter specifies the type of data the column can hold (e.g. varchar, integer, date, etc.).
- Tip: For an overview of the available data types, go to our complete Data Types Reference.

>Syntax
>
>CREATE TABLE table_name (
>
>    column1 datatype,
>
>    column2 datatype,
>
>    column3 datatype,
>
>   ....
>
>);


SQL CREATE TABLE Example

In [55]:
#cur.execute('''DROP TABLE testDB.Persons;''')

In [56]:
#The following example creates a table called "Persons" that contains five columns: PersonID, LastName, FirstName, Address, and City:
cur.execute('''CREATE TABLE testDB.Persons (
    PersonID int,
    LastName varchar(255),
    FirstName varchar(255),
    Address varchar(255),
    City varchar(255)
);''')

0

- The PersonID column is of type int and will hold an integer.
- The LastName, FirstName, Address, and City columns are of type varchar and will hold characters, and the maximum length for these fields is 255 characters.

The empty "Persons" table will now look like this:

In [57]:
# Return data from the Customers table:
cur.execute('''SELECT * FROM testDB.Persons;''')
df = pd.DataFrame(tuple(t) for t in cur.fetchall())
columns = [i[0] for i in cur.description]
if len(df) == 0: df = pd.DataFrame([["" for i in range(len(columns))]])
df.columns = columns
df

  PersonID LastName FirstName Address City
0

Tip: The empty "Persons" table can now be filled with data with the SQL INSERT INTO statement.

In [5]:
cur.execute('''INSERT INTO testDB.Persons VALUES
(1, 'Hansen', 'Ola', 'Timoteivn 10', 'Sandnes'),
(2, 'Svendson', 'Tove', 'Borgvn 23', 'Sandnes'),
(3, 'Pettersen', 'Kari', 'Storgt 20', 'Stavanger');''')
conn.commit()

Create Table Using Another Table
- A copy of an existing table can also be created using CREATE TABLE.
- The new table gets the same column definitions. All columns or specific columns can be selected.
- If you create a new table using an existing table, the new table will be filled with the existing values from the old table.

>Syntax
>
>CREATE TABLE new_table_name AS
>
>    SELECT column1, column2,...
>
>    FROM existing_table_name
>
>    WHERE ....;

In [73]:
#cur.execute('''DROP TABLE testDB.TestTable;''')

In [71]:
# The following SQL creates a new table called "TestTables" (which is a copy of the "Customers" table): 
cur.execute('''CREATE TABLE testDB.TestTable AS
SELECT CustomerName, ContactName
FROM testDB.Customers;''')

91

In [72]:
# Return data from the TestTable table:
cur.execute('''SELECT * FROM testDB.TestTable;''')
df = pd.DataFrame(tuple(t) for t in cur.fetchall())
columns = [i[0] for i in cur.description]
if len(df) == 0: df = pd.DataFrame([["" for i in range(len(columns))]])
df.columns = columns
df

                          CustomerName         ContactName
0                  Alfreds Futterkiste        Maria Anders
1   Ana Trujillo Emparedados y helados        Ana Trujillo
2              Antonio Moreno Taquería      Antonio Moreno
3                      Around the Horn        Thomas Hardy
4                   Berglunds snabbköp  Christina Berglund
..                                 ...                 ...
86                      Wartian Herkku    Pirkko Koskitalo
87              Wellington Importadora       Paula Parente
88                White Clover Markets      Karl Jablonski
89                         Wilman Kala     Matti Karttunen
90                              Wolski             Zbyszek

[91 rows x 2 columns]